// المهام -->

// <!-- المهمة الأولى -->

// <!-- .في هذه المهمة، ستقوم بإنشاء نظام توظيف 
//      .ستطرح على المستخدم بعض الأسئلة، واعتمادًا على إجاباته، ستقبل مقدم الطلب أو ترفضه -->

// <!-- :لقبول المتقدم للوظيفة يجد أن تتوفر فيه ثلاث شروط  -->










// let name = prompt("ما اسمك؟")
// let age = prompt("كم عمرك؟")
// let exp = prompt("كم عدد سنوات الخبرة لديك؟")
// console.log("1. HTML")
// console.log("2. CSS")
// console.log("3. Javascript")
// console.log("4. Swift")
// console.log("5. Java")
// console.log("6. php")
// let code = prompt("اختار تتقنها من لغات البرمجة المذكورة بإدخال رقمها")
// let codetwo = prompt("اختار لغة برمجة أخرى")
// taskone()
// function taskone (){
//     if (40<age>25, exp >3, code <4, codetwo <4){
//       console.log(" تهانيا, تم قبولك يا" + name  )
//     }else{
//  console.log(" .ناسف, انت ليس رائعاً بشكل كافي لتعمل معنا")
//     }
// }
















// <!-- أن يكون عمره أكبر من 25 وأقل من 40 -->
// <!-- أن تكون عنده سنوات خبرة تزيد عن 3 سنوات -->
// <!-- أن تكون إحدى لغات البرمجة التي يبرمج بها المتقدم للوظيفة 
//      هي لغة البرمجة المطلوبة من قبل البرنامج -->

// <!-- قم بكتابة السطور البرمجية اللازمة 
//      qu1.mov للحصول على النتيجة الموضحة في الفيديو -->

// <!-- 🔥بونص المهمة الأولى -->
// <!-- قم ببناء واجهة تستقبل المدخلات من المستخدم عن طريق حقول إدخال 
//      وإظهار النتائج على الصفحة -->

// <!-- -.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.- -->

// <!-- المهمة الثانية -->

// <!-- 🌡في هذه المهمة، ستقوم ببناء مقياس درجات حرارة فاخر -->

// <!-- الخطوات -->














// let temp = [32, 70, 99 ,106];
// console.log(temp)
// console.log(temp[0])
// console.log(temp[1])
// console.log(temp[2])
// console.log(temp[3])
// console.log("--------------------------------------------")
// temper(temp[0])
// temper(temp[1])
// temper(temp[2])
// temper(temp[3])

// function temper (x){
//     console.log((x - 32) * 5/9)
//     console.log("--------------------------------------------")  
// }


















// <!-- consoleقم بكتابة دالة تستقبل مصفوفة من درجات الحرارة وتقوم بطباعتها في ال -->
// <!-- classwork في ال logger() تذكر دالة -->

// <!-- قم بكتابة دالة تستقبل مصفوفة من درجات الحرارة بالفهرنهايت 
//      وترجع مصفوفة بهذه القيم محولة إلى المقياس السيليزي -->
// <!-- C = (F - 32) * (5/9) استخدم العملية -->

// <!-- قم بكتابة دالة تستقبل مصفوفة من درجات بالمقيا السيليزي وقيمة مبدئية/أولية 
//      وتقوم بإرجاع مصفوفة من درجات الحرارة الأكبر من القيمة المبدئية -->
// <!-- classwork في ال hottestDays() تذكر دالة -->

// <!-- قم بكتابة دالة تستقبل مصفوفة من درجات الحرارة وقيمة مبدئية بالفهرنهايت -->
// <!-- console وتقوم بطباعة درجات الحرارة الأكبر من القيمة المبدئية بالسيليزي في ال -->

// <!-- قم بكتابة السطور البرمجية اللازمة 
//      task22.png و task21.png للحصول على النتيجة الموضحة في الصور -->

// <!-- 🔥بونص المهمة الثانية -->
// <!-- for loop بدلاً من .forEach .filter .map قم باستخدام طرق -->

// <!-- -.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.-.- -->

// <!-- المهمة الثالثة -->





let grade = []

let counter = 0;

function grades(){
grade.push = document.getElementById("input").value;
 counter = counter + grade[1] + grade[2] + grade[3] + grade [4];
if( counter >= 90){
    document.getElementById("gradenum").innerHTML= ("Your Numeric Grade Is : ") + counter;
    document.getElementById("gradelt").innerHTML= ("Your Letter Grade Is : A");
}

}














// <!-- في هذه المهمة ستقوم بإنشاء حاسبة درجات -->

// <!-- تستقبل الآلة الحاسبة درجاتك في من خلال حقول إدخال -->
// <!-- 
//     quizes      /10
//     midterm     /25
//     final test  /50
//     oral        /15 
// -->

// <!-- تقوم الآلة الحاسبة بإجراء الحسابات اللازمة لحساب مجموع درجاتك بحيث -->
// <!-- 
//     90 - 100                 A
//     أكبر من أو يساوي 80      B
//     أكبر من أو يساوي 70      C
//     أكبر من أو يساوي 60      D
//     عدا ذلك                  F 
// -->

// <!-- ثم يظهر مجموعك النهائي على الصفحة
//      A, B, C, D or F مع درجتك بالحروف -->

// <!-- 🔥بونص المهمة الثالثة -->
// <!-- قم بجعل المستخدم يدخل درجاته دفعة 
//      وكتابة فاصلة بين كل درجة ودرجة 
//      task3 فتصبح بحاجة إلى استخدام حقل إدخال واحد فقط كما في الصورة -->

// <!-- A, B, C, D or F مميز في الصفحة لكل درجة GIF قم بإدراج -->

// <!-- HTML and CSS قم بإنشاء التصميم الخاص بك للموقع من خلال لغتي -->

// <!-- 😈لننتقل إلى المرحلة التالية -->

// <!-- انتبه المرحلة القادمة أصعب -->
// <!-- بالشكل المطلوب JavaScript إياك والتقدم إن لم تكن قد فهمت أساسيات -->

// <!-- ⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮⾮ -->

// <!-- المهمة الرابعة -->
// <!--
//     ------------------------------------------------------------------
//     #                                                                #
//     #                                                                #                              
//     #                    هذه المهمة محجوبة حالياً                     #
//     #                إلى أن تنتهي من المهام الثلاث الأولى              #
//     #                                                                #
//     #                                                                #
//     #                                                                #
//     ------------------------------------------------------------------
// -->

// <!-- المهمة الخامسة -->
// <!--
//     ------------------------------------------------------------------
//     #                                                                #
//     #                                                                #                              
//     #                    هذه المهمة محجوبة حالياً                     #
//     #                إلى أن تنتهي من المهام الثلاث الأولى              #
//     #                                                                #
//     #                                                                #
//     #                                                                #
//     ------------------------------------------------------------------
//  -->
